Revit 2024 API
AnalysisDisplayDiagramSettings Class
 Contains diagram settings for analysis display style element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class AnalysisDisplayDiagramSettings : IDisposable
Visual Basic
Public Class AnalysisDisplayDiagramSettings _
	Implements IDisposable
Visual C++
public ref class AnalysisDisplayDiagramSettings : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings
See Also
AnalysisDisplayDiagramSettings Members
Autodesk.Revit.DB.Analysis Namespace